fixes/flake8Agent/date/20260115-1406/diff-files/src_infrastructure_dev_agent_tests_mutation_testing.py.fix.diff
diff --git a/src/infrastructure/dev/agent_tests/mutation_testing.py b/src/infrastructure/dev/agent_tests/mutation_testing.py
index f77c07f..9224f98 100644
--- a/src/infrastructure/dev/agent_tests/mutation_testing.py
+++ b/src/infrastructure/dev/agent_tests/mutation_testing.py
@@ -23,12 +23,21 @@
 from __future__ import annotations
 from src.core.base.version import VERSION
 import hashlib
-from typing import List, Dict
 from .enums import MutationOperator
 from .models import Mutation
 
 __version__ = VERSION
 
+
+
+
+
+
+
+
+
+
+
 class MutationTester:
     """Test mutation analysis."""
 
@@ -107,11 +116,21 @@ class MutationTester:
             for mut in surviving[:10]:
                 report.append(
                     f"- Line {mut.line_number}: {mut.operator.value} "
+
+
+
+
+
                     f"(`{mut.original_code.strip()}` -> `{mut.mutated_code.strip()}`)"
                 )
 
         return "\n".join(report)
 
+
+
+
+
+
 class MutationRunner:
     """Run mutation testing analysis."""
 
@@ -144,4 +163,4 @@ class MutationRunner:
 
     def get_mutation_score(self) -> float:
         """Get mutation score."""
-        return self.tester.get_mutation_score()
\ No newline at end of file
+        return self.tester.get_mutation_score()
